In [2]:
import pandas as pd
import numpy as np

In [2]:
# ls = [1,2,3,4,5]

# 위의 리스트를 series S로 만드시오.

# S에서 3을 출력하시오.

# S에서 2, 3을 출력하시오.

# S에서 3, 4, 5를 출력하시오

# S에서 3을 10으로 수정하시오

# S에서 3 보다 큰 수를 출력하시오

# S에서  인덱스를 출력하시오.

# S에서 value를 출력하시오

In [3]:
ls = [1,2,3,4,5]
list_a = np.array(ls)

In [4]:
type(list_a)

numpy.ndarray

In [5]:
df = pd.DataFrame(ls)

In [6]:
df

   0
0  1
1  2
2  3
3  4
4  5

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
S = pd.Series(ls)
S

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
type(S)

pandas.core.series.Series

In [10]:
# S에서 3을 출력하시오.
S[2]

3

In [11]:
# S에서 2, 3을 출력하시오.
S[1:3]

1    2
2    3
dtype: int64

In [12]:
# S에서 3, 4, 5를 출력하시오
S[2:]

2    3
3    4
4    5
dtype: int64

In [13]:
# S에서 3을 10으로 수정하시오
S[2] = 10
S

0     1
1     2
2    10
3     4
4     5
dtype: int64

In [14]:
# S에서 3 보다 큰 수를 출력하시오
S[S.values > 3]

2    10
3     4
4     5
dtype: int64

In [15]:
# S에서  인덱스를 출력하시오
S.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
# S에서 value를 출력하시오
S.values

array([ 1,  2, 10,  4,  5], dtype=int64)

In [17]:
# raw_data= {'first_name':['jason',np.nan, 'tina','jake','amy'],

#           'last_name':['miller', np.nan, 'all','miler','coozer'],

#           'age':[42, np.nan, 36, 24, 73],

#           'sex':['m', np.nan, 'f','m','f'],

#           'pretestscore':[4, np.nan, np.nan, 2, 3],

#           'posttestscore':[25, np.nan, np.nan, 62, 70]}

In [115]:
# 위의 dict를 dataframe df로 만드시오..
raw_data= {'first_name':['jason',np.nan, 'tina','jake','amy'],

          'last_name':['miller', np.nan, 'all','miler','coozer'],

          'age':[42, np.nan, 36, 24, 73],

          'sex':['m', np.nan, 'f','m','f'],

          'pretestscore':[4, np.nan, np.nan, 2, 3],

          'posttestscore':[25, np.nan, np.nan, 62, 70]}

df = pd.DataFrame(raw_data)
df

  first_name last_name   age  sex  pretestscore  posttestscore
0      jason    miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       tina       all  36.0    f           NaN            NaN
3       jake     miler  24.0    m           2.0           62.0
4        amy    coozer  73.0    f           3.0           70.0

In [116]:
# df에서 columns을 추출하시오.
df.columns

Index(['first_name', 'last_name', 'age', 'sex', 'pretestscore',
       'posttestscore'],
      dtype='object')

In [117]:
# df에서 index를 추출하시오.
df.index

RangeIndex(start=0, stop=5, step=1)

In [118]:
# df에서 column ‘Sex’를 추출하시오.
df['sex']

0      m
1    NaN
2      f
3      m
4      f
Name: sex, dtype: object

In [119]:
# df에서 column ‘Sex’와 'posttestscore'를 추출하시오 
df[['sex','posttestscore']]

   sex  posttestscore
0    m           25.0
1  NaN            NaN
2    f            NaN
3    m           62.0
4    f           70.0

In [120]:
# df에서 column ‘Sex’와 'pretestscore', 'posttestscore'를 추출하시오 
df[df.columns[3:]]

   sex  pretestscore  posttestscore
0    m           4.0           25.0
1  NaN           NaN            NaN
2    f           NaN            NaN
3    m           2.0           62.0
4    f           3.0           70.0

In [121]:
# df에서 index를 ['a','b','c','d','e']로 수정하시오.
df.index = 'a','b','c','d','e'

In [122]:
df

  first_name last_name   age  sex  pretestscore  posttestscore
a      jason    miller  42.0    m           4.0           25.0
b        NaN       NaN   NaN  NaN           NaN            NaN
c       tina       all  36.0    f           NaN            NaN
d       jake     miler  24.0    m           2.0           62.0
e        amy    coozer  73.0    f           3.0           70.0

In [123]:
# df에서 row 'a'를 출력하시오.
df.loc['a',:]

first_name        jason
last_name        miller
age                42.0
sex                   m
pretestscore        4.0
posttestscore      25.0
Name: a, dtype: object

In [124]:
# df에서 row 'a', ‘b’, ‘c’를 출력하시오.
df.loc['a':'c',:]

  first_name last_name   age  sex  pretestscore  posttestscore
a      jason    miller  42.0    m           4.0           25.0
b        NaN       NaN   NaN  NaN           NaN            NaN
c       tina       all  36.0    f           NaN            NaN

In [125]:
 # df에서 첫번째, 두번째 row 를 출력하시오.
df.iloc[:2,:]

  first_name last_name   age  sex  pretestscore  posttestscore
a      jason    miller  42.0    m           4.0           25.0
b        NaN       NaN   NaN  NaN           NaN            NaN

In [126]:
# 'age'가 40 이상인 사람의 이름을 추출..
df[df['age'] > 40]

  first_name last_name   age sex  pretestscore  posttestscore
a      jason    miller  42.0   m           4.0           25.0
e        amy    coozer  73.0   f           3.0           70.0

In [127]:
# 'jason'의 prestestscore는 얼마인가?
df[df['first_name']=='jason']['posttestscore']

a    25.0
Name: posttestscore, dtype: float64

In [128]:
# 여성의 평균 나이..
df[df['sex']=='f']['age'].mean()

54.5

In [129]:
# 최고령자의 이름...
df['age'].max()

73.0

In [130]:
# 새로운 값은 [42,25,78,41,23]인 새로운 칼럼 ‘age’ 를 추가하시오.
df['addr'] = [42,25,78,41,23]
df

  first_name last_name   age  sex  pretestscore  posttestscore  addr
a      jason    miller  42.0    m           4.0           25.0    42
b        NaN       NaN   NaN  NaN           NaN            NaN    25
c       tina       all  36.0    f           NaN            NaN    78
d       jake     miler  24.0    m           2.0           62.0    41
e        amy    coozer  73.0    f           3.0           70.0    23

In [131]:
# 칼럼 이름을 ['fn','ln','age','sex','prets','postts', 'addr']로 수정하시오.
df.columns = ['fn','ln','age','sex','prets','postts', 'addr']
df

      fn      ln   age  sex  prets  postts  addr
a  jason  miller  42.0    m    4.0    25.0    42
b    NaN     NaN   NaN  NaN    NaN     NaN    25
c   tina     all  36.0    f    NaN     NaN    78
d   jake   miler  24.0    m    2.0    62.0    41
e    amy  coozer  73.0    f    3.0    70.0    23

In [132]:
# 칼럼 ‘addr’을 삭제하시오.
df.drop('addr', axis=1, inplace=True)
df

      fn      ln   age  sex  prets  postts
a  jason  miller  42.0    m    4.0    25.0
b    NaN     NaN   NaN  NaN    NaN     NaN
c   tina     all  36.0    f    NaN     NaN
d   jake   miler  24.0    m    2.0    62.0
e    amy  coozer  73.0    f    3.0    70.0

In [133]:
# row ‘b’를 삭제하시오.
df.drop('b', axis=0, inplace=True)
df

      fn      ln   age sex  prets  postts
a  jason  miller  42.0   m    4.0    25.0
c   tina     all  36.0   f    NaN     NaN
d   jake   miler  24.0   m    2.0    62.0
e    amy  coozer  73.0   f    3.0    70.0

In [134]:
# (df에서 row의 null갯수를 계산하시오..)
df.isna().sum(axis=1)

a    0
c    2
d    0
e    0
dtype: int64

In [135]:
# (null값이 포함된 col을 삭제하시오..)
df.dropna(axis=1)

      fn      ln   age sex
a  jason  miller  42.0   m
c   tina     all  36.0   f
d   jake   miler  24.0   m
e    amy  coozer  73.0   f

In [136]:
# (null값을 0으로 채우시오..)
df.fillna(0)

      fn      ln   age sex  prets  postts
a  jason  miller  42.0   m    4.0    25.0
c   tina     all  36.0   f    0.0     0.0
d   jake   miler  24.0   m    2.0    62.0
e    amy  coozer  73.0   f    3.0    70.0

In [137]:
data = {'Team':['Riders','Riders','Devils','Devils','Kings','Giant',\

               'Kings','Kings','Riders','Royals','Royals','Riders'],\

       'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],\

       'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],\

       'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

In [138]:
# data를 dataframe df로 만드시오..
df = pd.DataFrame(data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Giant     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [139]:
# ‘Devils’의 points 평균값은?
df[df['Team']=='Devils']['Points'].mean()

768.0

In [140]:
# 팀별로 몇 개씩의 데이터가 있는가?
df.groupby('Team')['Rank'].count()

Team
Devils    2
Giant     1
Kings     3
Riders    4
Royals    2
Name: Rank, dtype: int64

In [141]:
# 팀별로 가장 놓은 랭킹은 어떻게 되는가?
df.groupby('Team')['Rank'].min()

Team
Devils    2
Giant     4
Kings     1
Riders    1
Royals    1
Name: Rank, dtype: int64

In [142]:
# ‘Team’의 이름을 모두 대문자로 수정하시오..
df['Team'].str.upper()

0     RIDERS
1     RIDERS
2     DEVILS
3     DEVILS
4      KINGS
5      GIANT
6      KINGS
7      KINGS
8     RIDERS
9     ROYALS
10    ROYALS
11    RIDERS
Name: Team, dtype: object

In [184]:
raw_data= {'first_name':['jason',np.nan, 'tina','jake','amy'],

          'last_name':['miller', np.nan, 'all','miler','coozer'],

          'age':[42, np.nan, 36, 24, 73],

          'sex':['m', np.nan, 'f','m','f'],

          'pretestscore':[4, np.nan, np.nan, 2, 3],

          'posttestscore':[25, np.nan, np.nan, 62, 70]}

In [185]:
# row별 nan값의 개수를 출력하시오.
df = pd.DataFrame(raw_data)

In [186]:
df.isna().sum(axis=1)

0    0
1    6
2    2
3    0
4    0
dtype: int64

In [187]:
# column별 nan값의 개수를 출력하시오..
df.isna().sum()

first_name       1
last_name        1
age              1
sex              1
pretestscore     2
posttestscore    2
dtype: int64

In [188]:
# nan값이 포함된 row를 삭제하시오.
df.dropna(axis=0)

  first_name last_name   age sex  pretestscore  posttestscore
0      jason    miller  42.0   m           4.0           25.0
3       jake     miler  24.0   m           2.0           62.0
4        amy    coozer  73.0   f           3.0           70.0

In [189]:
df

  first_name last_name   age  sex  pretestscore  posttestscore
0      jason    miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       tina       all  36.0    f           NaN            NaN
3       jake     miler  24.0    m           2.0           62.0
4        amy    coozer  73.0    f           3.0           70.0

In [182]:
# 데이터가 2개 이하인 row를 삭제하시오 
df.dropna(thresh=2)

  first_name last_name  age sex  pretestscore  posttestscore
0          0         0  0.0   0           0.0            0.0
2          1         1  1.0   1           1.0            1.0
3          0         0  0.0   0           0.0            0.0
4          1         1  1.0   1           1.0            1.0

In [174]:
# nan값이 포함된 column을 삭제하시오.
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [175]:
# nan값을 ‘0’으로 채우시오.
df.fillna(0)

  first_name last_name   age sex  pretestscore  posttestscore
0      jason    miller  42.0   m           4.0           25.0
1          0         0   0.0   0           0.0            0.0
2       tina       all  36.0   f           0.0            0.0
3       jake     miler  24.0   m           2.0           62.0
4        amy    coozer  73.0   f           3.0           70.0

In [176]:
# ‘age’를 기준으로 내림차순으로 정렬하시오.
df.sort_values('age', ascending=False)

  first_name last_name   age  sex  pretestscore  posttestscore
4        amy    coozer  73.0    f           3.0           70.0
0      jason    miller  42.0    m           4.0           25.0
2       tina       all  36.0    f           NaN            NaN
3       jake     miler  24.0    m           2.0           62.0
1        NaN       NaN   NaN  NaN           NaN            NaN

In [177]:
# ‘sex’ 칼럼에서 남성이면 0, 여성이면 1의 값으로 수정하시오..
df[df['sex']=='m'] = df[df['sex']=='m'].apply(lambda x:0)
df[df['sex']=='f'] = df[df['sex']=='f'].apply(lambda x:1)

In [178]:
df

  first_name last_name  age  sex  pretestscore  posttestscore
0          0         0  0.0    0           0.0            0.0
1        NaN       NaN  NaN  NaN           NaN            NaN
2          1         1  1.0    1           1.0            1.0
3          0         0  0.0    0           0.0            0.0
4          1         1  1.0    1           1.0            1.0

In [4]:
raw_data = {

        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],

        'test_score': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

df1 = pd.DataFrame(raw_data)

 

raw_data = {

        'subject_id': ['4', '5', '6', '7', '8'],

        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],

        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

df2 = pd.DataFrame(raw_data)

In [5]:
df1.head(2)

  subject_id  test_score
0          1          51
1          2          15

In [6]:
df2.head(2)

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black

In [17]:
# dataframe df1과 df2를 칼럼 ‘subject_id’를 기준으로 4가지 방식으로 병합하시오
df_inner = pd.merge(df1,df2) 
df_inner

  subject_id  test_score first_name last_name
0          4          61      Billy    Bonder
1          5          16      Brian     Black
2          7          14      Bryce     Brice
3          8          15      Betty    Btisan

In [18]:
df_outer = pd.merge(df1,df2, how='outer', on='subject_id')
df_outer

   subject_id  test_score first_name last_name
0           1        51.0        NaN       NaN
1           2        15.0        NaN       NaN
2           3        15.0        NaN       NaN
3           4        61.0      Billy    Bonder
4           5        16.0      Brian     Black
5           7        14.0      Bryce     Brice
6           8        15.0      Betty    Btisan
7           9         1.0        NaN       NaN
8          10        61.0        NaN       NaN
9          11        16.0        NaN       NaN
10          6         NaN       Bran   Balwner

In [19]:
df_left = pd.merge(df1, df2, how='left', left_on='subject_id', right_on='subject_id')
df_left

  subject_id  test_score first_name last_name
0          1          51        NaN       NaN
1          2          15        NaN       NaN
2          3          15        NaN       NaN
3          4          61      Billy    Bonder
4          5          16      Brian     Black
5          7          14      Bryce     Brice
6          8          15      Betty    Btisan
7          9           1        NaN       NaN
8         10          61        NaN       NaN
9         11          16        NaN       NaN

In [20]:
df_right = pd.merge(df1, df2, how='right', left_on='subject_id', right_on='subject_id')
df_right

  subject_id  test_score first_name last_name
0          4        61.0      Billy    Bonder
1          5        16.0      Brian     Black
2          6         NaN       Bran   Balwner
3          7        14.0      Bryce     Brice
4          8        15.0      Betty    Btisan

In [24]:
# df1과 df2를 column방향으로 연결하시오..
pd.concat([df1,df2])

  subject_id  test_score first_name last_name
0          1        51.0        NaN       NaN
1          2        15.0        NaN       NaN
2          3        15.0        NaN       NaN
3          4        61.0        NaN       NaN
4          5        16.0        NaN       NaN
5          7        14.0        NaN       NaN
6          8        15.0        NaN       NaN
7          9         1.0        NaN       NaN
8         10        61.0        NaN       NaN
9         11        16.0        NaN       NaN
0          4         NaN      Billy    Bonder
1          5         NaN      Brian     Black
2          6         NaN       Bran   Balwner
3          7         NaN      Bryce     Brice
4          8         NaN      Betty    Btisan

In [97]:
# df1과 df2를 row방향으로 연결하시오..
pd.concat([df1,df2], axis=1)

  subject_id  test_score subject_id first_name last_name
0          1          51          4      Billy    Bonder
1          2          15          5      Brian     Black
2          3          15          6       Bran   Balwner
3          4          61          7      Bryce     Brice
4          5          16          8      Betty    Btisan
5          7          14        NaN        NaN       NaN
6          8          15        NaN        NaN       NaN
7          9           1        NaN        NaN       NaN
8         10          61        NaN        NaN       NaN
9         11          16        NaN        NaN       NaN